Revit.Elements.CurtainPanel
A Revit CurtainPanel

Revit.Elements.CurtainPanel.#ctor(Autodesk.Revit.DB.Panel)
Create from an existing Revit Element
panelElement:

Revit.Elements.CurtainPanel.InitCurtainPanel(Autodesk.Revit.DB.Panel)
Initialize a CurtainPanel element
panelElement:

Revit.Elements.CurtainPanel.ByElement(Revit.Elements.CurtainPanel)
get curtain panel from element
panelElement:

Revit.Elements.CurtainPanel.ByElement(Revit.Elements.Element)
get all panels of curtain wall, system or slope galzing roof
hostingElement:

Revit.Elements.CurtainPanel.FromExisting(Autodesk.Revit.DB.Panel,System.Boolean)
Construct this type from an existing Revit element.
panel:
isRevitOwned:
Returns:

Revit.Elements.CurtainPanel.SupportingMullions
Gets Mullions hosting the specified curtain panel
Returns:

Revit.Elements.CurtainPanel.AsFamilyInstance
Gets family instance from curtainPanel
Returns:

Revit.Elements.CurtainPanel.Boundaries
Gets curtain panel boundaries

Revit.Elements.CurtainPanel.HasPlane
Checks if the specific curtain panel is planar

Revit.Elements.CurtainPanel.PanelPlane
Gets a plane of the given curtain panel, if it is planar

Revit.Elements.CurtainPanel.Length
Gets the length of the specific curtain panel boundaries

Revit.Elements.CurtainPanel.IsRectangular
Checks whether the specific curtain panel is rectangular. Returns
true if the curtain panel is rectangular. Otherwise returns false

Revit.Elements.CurtainPanel.Width
Gets the width of the specific curtain panel, if it's rectangular

Revit.Elements.CurtainPanel.Height
Gets the height of the specific curtain panel, if it's rectangular